loadtest/evidencias/resultados-k6/vus-100-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/k6/smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 100 VUs  0m00.7s/1m0s

running (0m02.0s), 100/100 VUs, 52 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m01.7s/1m0s

running (0m03.0s), 100/100 VUs, 123 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m02.7s/1m0s

running (0m04.0s), 100/100 VUs, 200 complete and 0 interrupted iterations
default   [   6% ] 100 VUs  0m03.7s/1m0s

running (0m05.0s), 100/100 VUs, 286 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m04.7s/1m0s

running (0m06.0s), 100/100 VUs, 368 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m05.7s/1m0s

running (0m07.0s), 100/100 VUs, 450 complete and 0 interrupted iterations
default   [  11% ] 100 VUs  0m06.7s/1m0s

running (0m08.0s), 100/100 VUs, 533 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m07.7s/1m0s

running (0m09.0s), 100/100 VUs, 619 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m08.7s/1m0s

running (0m10.0s), 100/100 VUs, 701 complete and 0 interrupted iterations
default   [  16% ] 100 VUs  0m09.7s/1m0s

running (0m11.0s), 100/100 VUs, 787 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m10.7s/1m0s

running (0m12.0s), 100/100 VUs, 874 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m11.7s/1m0s

running (0m13.0s), 100/100 VUs, 959 complete and 0 interrupted iterations
default   [  21% ] 100 VUs  0m12.7s/1m0s

running (0m14.0s), 100/100 VUs, 1043 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m13.7s/1m0s

running (0m15.0s), 100/100 VUs, 1126 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  0m14.7s/1m0s

running (0m16.0s), 100/100 VUs, 1212 complete and 0 interrupted iterations
default   [  26% ] 100 VUs  0m15.7s/1m0s

running (0m17.0s), 100/100 VUs, 1304 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m16.7s/1m0s

running (0m18.0s), 100/100 VUs, 1396 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  0m17.7s/1m0s

running (0m19.0s), 100/100 VUs, 1486 complete and 0 interrupted iterations
default   [  31% ] 100 VUs  0m18.7s/1m0s

running (0m20.0s), 100/100 VUs, 1577 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m19.7s/1m0s

running (0m21.0s), 100/100 VUs, 1670 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  0m20.7s/1m0s
time="2026-07-13T16:07:50-03:00" level=warning msg="Request Failed" error="Post \"https://kiriland.unb.br/keycloak/realms/grupo03/protocol/openid-connect/token\": dial tcp 164.41.20.252:443: connectex: Uma tentativa de conexão falhou porque o componente conectado não respondeu\r\ncorretamente após um período de tempo ou a conexão estabelecida falhou\r\nporque o host conectado não respondeu."
time="2026-07-13T16:07:50-03:00" level=warning msg="Request Failed" error="Post \"https://kiriland.unb.br/keycloak/realms/grupo03/protocol/openid-connect/token\": dial tcp 164.41.20.252:443: connectex: Uma tentativa de conexão falhou porque o componente conectado não respondeu\r\ncorretamente após um período de tempo ou a conexão estabelecida falhou\r\nporque o host conectado não respondeu."
time="2026-07-13T16:07:50-03:00" level=warning msg="Request Failed" error="Post \"https://kiriland.unb.br/keycloak/realms/grupo03/protocol/openid-connect/token\": dial tcp 164.41.20.252:443: connectex: Uma tentativa de conexão falhou porque o componente conectado não respondeu\r\ncorretamente após um período de tempo ou a conexão estabelecida falhou\r\nporque o host conectado não respondeu."

running (0m22.0s), 100/100 VUs, 1760 complete and 0 interrupted iterations
default   [  36% ] 100 VUs  0m21.7s/1m0s

running (0m23.0s), 100/100 VUs, 1853 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m22.7s/1m0s

running (0m24.0s), 100/100 VUs, 1948 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  0m23.7s/1m0s

running (0m25.0s), 100/100 VUs, 2046 complete and 0 interrupted iterations
default   [  41% ] 100 VUs  0m24.7s/1m0s

running (0m26.0s), 100/100 VUs, 2141 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m25.7s/1m0s

running (0m27.0s), 100/100 VUs, 2234 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  0m26.7s/1m0s

running (0m28.0s), 100/100 VUs, 2326 complete and 0 interrupted iterations
default   [  46% ] 100 VUs  0m27.7s/1m0s

running (0m29.0s), 100/100 VUs, 2417 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m28.7s/1m0s

running (0m30.0s), 100/100 VUs, 2511 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  0m29.7s/1m0s

running (0m31.0s), 100/100 VUs, 2608 complete and 0 interrupted iterations
default   [  51% ] 100 VUs  0m30.7s/1m0s

running (0m32.0s), 100/100 VUs, 2705 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  0m31.7s/1m0s

running (0m33.0s), 100/100 VUs, 2803 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  0m32.7s/1m0s

running (0m34.0s), 100/100 VUs, 2898 complete and 0 interrupted iterations
default   [  56% ] 100 VUs  0m33.7s/1m0s

running (0m35.0s), 100/100 VUs, 2988 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  0m34.7s/1m0s

running (0m36.0s), 100/100 VUs, 3084 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  0m35.7s/1m0s

running (0m37.0s), 100/100 VUs, 3182 complete and 0 interrupted iterations
default   [  61% ] 100 VUs  0m36.7s/1m0s

running (0m38.0s), 100/100 VUs, 3279 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  0m37.7s/1m0s

running (0m39.0s), 100/100 VUs, 3374 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  0m38.7s/1m0s

running (0m40.0s), 100/100 VUs, 3471 complete and 0 interrupted iterations
default   [  66% ] 100 VUs  0m39.7s/1m0s

running (0m41.0s), 100/100 VUs, 3566 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  0m40.7s/1m0s

running (0m42.0s), 100/100 VUs, 3655 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  0m41.7s/1m0s

running (0m43.0s), 100/100 VUs, 3749 complete and 0 interrupted iterations
default   [  71% ] 100 VUs  0m42.7s/1m0s

running (0m44.0s), 100/100 VUs, 3836 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  0m43.7s/1m0s

running (0m45.0s), 100/100 VUs, 3926 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  0m44.7s/1m0s

running (0m46.0s), 100/100 VUs, 4015 complete and 0 interrupted iterations
default   [  76% ] 100 VUs  0m45.7s/1m0s

running (0m47.0s), 100/100 VUs, 4110 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  0m46.7s/1m0s

running (0m48.0s), 100/100 VUs, 4203 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  0m47.7s/1m0s

running (0m49.0s), 100/100 VUs, 4297 complete and 0 interrupted iterations
default   [  81% ] 100 VUs  0m48.7s/1m0s

running (0m50.0s), 100/100 VUs, 4393 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  0m49.7s/1m0s

running (0m51.0s), 100/100 VUs, 4483 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  0m50.7s/1m0s

running (0m52.0s), 100/100 VUs, 4572 complete and 0 interrupted iterations
default   [  86% ] 100 VUs  0m51.7s/1m0s

running (0m53.0s), 100/100 VUs, 4664 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  0m52.7s/1m0s

running (0m54.0s), 100/100 VUs, 4758 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  0m53.7s/1m0s

running (0m55.0s), 100/100 VUs, 4853 complete and 0 interrupted iterations
default   [  91% ] 100 VUs  0m54.7s/1m0s

running (0m56.0s), 100/100 VUs, 4949 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  0m55.7s/1m0s

running (0m57.0s), 100/100 VUs, 5044 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  0m56.7s/1m0s

running (0m58.0s), 100/100 VUs, 5140 complete and 0 interrupted iterations
default   [  96% ] 100 VUs  0m57.7s/1m0s

running (0m59.0s), 100/100 VUs, 5236 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  0m58.7s/1m0s

running (1m00.0s), 100/100 VUs, 5332 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  0m59.7s/1m0s

running (1m01.0s), 057/100 VUs, 5429 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  1m0s

running (1m02.0s), 002/100 VUs, 5484 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  1m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<1.0' rate=95.94%


  █ TOTAL RESULTS 

    checks_total.......: 14677  233.080858/s
    checks_succeeded...: 99.95% 14671 out of 14677
    checks_failed......: 0.04%  6 out of 14677

    ✗ login: status 200
      ↳  97% — ✓ 101 / ✗ 3
    ✗ login: access_token presente
      ↳  97% — ✓ 101 / ✗ 3
    ✓ get_patient: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_patient_history: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_cohort_statistics: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_supervised_patients: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_patient_summary: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_cohort_exams: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_my_patients: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_my_projects: respondeu (2xx, 403 ou 429 são esperados)

    CUSTOM
    auth_login_duration............: avg=79.98ms  min=0s     med=86.07ms max=262.84ms p(90)=102.16ms p(95)=106.59ms
    gateway_denied_rate............: 0.89%  129 out of 14469
    gateway_error_rate.............: 0.00%  0 out of 14469
    gateway_rate_limited_rate......: 95.72% 13851 out of 14469
    gateway_req_duration...........: avg=25.18ms  min=0s     med=4.14ms  max=3.08s    p(90)=5.56ms   p(95)=10.32ms 
    gateway_requests_total.........: 14469  229.777674/s
    login_error_rate...............: 2.88%  3 out of 104

    HTTP
    http_req_duration..............: avg=25.58ms  min=0s     med=4.14ms  max=3.08s    p(90)=5.72ms   p(95)=11.58ms 
      { expected_response:true }...: avg=520.85ms min=3.19ms med=50.89ms max=3.08s    p(90)=2.23s    p(95)=2.34s   
    http_req_failed................: 95.94% 13983 out of 14574
    http_reqs......................: 14574  231.445147/s

    EXECUTION
    iteration_duration.............: avg=1.1s     min=1s     med=1.01s   max=22.01s   p(90)=1.02s    p(95)=1.07s   
    iterations.....................: 5486   87.121454/s
    vus............................: 2      min=2              max=100
    vus_max........................: 100    min=100            max=100

    NETWORK
    data_received..................: 12 MB  186 kB/s
    data_sent......................: 25 MB  399 kB/s



running (1m03.0s), 000/100 VUs, 5486 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  1m0s